{
    "coord": {
        "lon": -8.4706,
        "lat": 51.898
    },
    "weather": [
        {
            "id": 741,
            "main": "Fog",
            "description": "fog",
            "icon": "50d"
        }
    ],
    "base": "stations",
    "main": {
        "temp": 283.15,
        "feels_like": 281.4,
        "temp_min": 283.15,
        "temp_max": 283.15,
        "pressure": 1008,
        "humidity": 100
    },
    "visibility": 300,
    "wind": {
        "speed": 2.57,
        "deg": 190
    },
    "clouds": {
        "all": 90
    },
    "dt": 1611759957,
    "sys": {
        "type": 1,
        "id": 1563,
        "country": "IE",
        "sunrise": 1611735642,
        "sunset": 1611767543
    },
    "timezone": 0,
    "id": 2965140,
    "name": "Cork",
    "cod": 200
}
// Change the sensor names CIT.NIM.VIR.ELEC.ANNUAL - First 3 characters of every b
// Certificate should be visualized the same way as present in the admin and energy consumption graph should be displayed to confirm the source
// Transactions for certificate should be part of the certificate.
// Building owner can generate DEC only after registering the building by a community manager
// DEC Calculation
// Add the documentation for the digiblocks onto the document on the SVN server
// Relate the DEC calculation to the blockchain
// System architecture is very important
// Have a DEC Sensor for the buildings
// Individual cert component should allow verification
// Transaction view with the certificate
// User roles - documentation
// Timeline visualization for transactions
// Focus on Data services 
// Deliverables for Work Package 3
// Add the table about user roles to the documentation
// Add the management view description to the Management View - the process of adding a building, user and assigning user to building. 
// Add description about the archeitecture that is there on the documentation. 
// More details about the individual views like the logic thats happening in the individual views
// Explain the intention the view and the benefit of the view. Doesn't help conserve energy but 
// gives you insight on where the energy is being consumed.
// DEC calculations - explain the sequence of activities. 
// Default icon and then different icon for every activity on the transaction view
// Walkthrough next week all the features
// Get the documentation done
// <a href="https://imgbb.com/"><img src="https://i.ibb.co/P5tsQk2/profile-placeholder.png" alt="profile-placeholder" border="0"></a>
// Better UI for he DEC transactions
// Change the UI of the transactions to a vertical output - it'll be useful to superimpose more information on the left hand side on the timeline. 
// Add the certificate keys to the documentation
// Add a generic marker to all the buildings 
// In the section for the building summary data for the graphs for the buildings in the only that we know how it is possible
// Add dlt status of the building to the asset itself. 
// rating on the building can be hyperlinked to the building's DEC data itself
// Add the work flow of the external verifier to the building modal
// Icons can be changed on the left hand side for the building itself.
// Building owners can also generate DEC data. 


